.presentation/.generated/ClusterTest - can load stock list and order item.md
```mermaid
C4Context
title ClusterTest - can load stock list and order item

System(customer, "Customer")
System(apigateway, "api-gateway")
System(shop, "shop")
System(warehouse, "warehouse")
System(cognito, "cognito")
ContainerDb(db, "db")
System(deptstore, "dept-store")
System(emaileuwest1amazonawscom, "email.eu-west-1.amazonaws.com")
System(eventstream, "event-stream")    
Rel_D(customer, apigateway, " ") 
Rel_D(customer, cognito, " ") 
Rel_D(apigateway, cognito, " ") 
Rel_D(apigateway, shop, " ") 
Rel_D(shop, warehouse, " ") 
Rel_D(warehouse, db, " ") 
Rel_D(warehouse, deptstore, " ") 
Rel_D(shop, emaileuwest1amazonawscom, " ") 
Rel_D(shop, eventstream, " ")     
```
